package com.xq.live.web.controller;

import com.alibaba.fastjson.JSONObject;
import com.xq.live.common.BaseResp;
import com.xq.live.common.PaymentConfig;
import com.xq.live.common.RandomStringUtil;
import com.xq.live.common.ResultStatus;
import com.xq.live.model.User;
import com.xq.live.model.UserBlacklist;
import com.xq.live.service.ShopService;
import com.xq.live.service.UserBlacklistService;
import com.xq.live.service.UserService;
import com.xq.live.vo.in.UserInVo;
import com.xq.live.vo.in.WeixinPhoneInvo;
import com.xq.live.web.utils.AESDecodeUtils;
import com.xq.live.web.utils.GetUserInfoUtil;
import com.xq.live.web.utils.IpUtils;
import com.xq.live.web.utils.PayUtils;
import org.apache.commons.codec.binary.Base64;
import org.apache.commons.lang3.StringUtils;
import org.springframework.beans.factory.annotation.Autowired;
import org.springframework.beans.factory.annotation.Value;
import org.springframework.security.authentication.BadCredentialsException;
import org.springframework.security.core.AuthenticationException;
import org.springframework.security.core.userdetails.UsernameNotFoundException;
import org.springframework.security.crypto.bcrypt.BCryptPasswordEncoder;
import org.springframework.stereotype.Controller;
import org.springframework.ui.Model;
import org.springframework.validation.BindingResult;
import org.springframework.validation.ObjectError;
import org.springframework.web.bind.annotation.*;

import javax.servlet.http.HttpServletRequest;
import javax.validation.Valid;
import java.text.SimpleDateFormat;
import java.util.*;

/**
 * @package: com.xq.live.web.controller
 * @description: 授权controller
 * @author: zhangpeng32
 * @date: 2018/4/20 15:55
 * @version: 1.0
 */
@Controller
@RequestMapping(value = "/auth")
public class AuthController {
    @Autowired
    private UserService userService;

    @Autowired
    private ShopService shopService;

    @Autowired
    private UserBlacklistService userBlacklistService;

    @Value("${jwt.password.salt}")
    private String salt;

    /**
     * 该方法是注册用户的方法，默认放开访问控制
     * @param in
     */
    @PostMapping("/signup")
    @ResponseBody
    public BaseResp<Long> signup(User in) throws AuthenticationException{
        if(in == null || StringUtils.isEmpty(in.getUserName())){
            return new BaseResp<Long>(ResultStatus.error_user_exist);
        }
        User user = userService.findByUsername(in.getUserName());
        if(user != null){
            return new BaseResp<Long>(ResultStatus.error_user_exist);
        }
        Long id  = userService.register(in);
        return new BaseResp<Long>(ResultStatus.SUCCESS, id);
    }

    @RequestMapping(value="/h5",method= RequestMethod.GET)
    public String getHost(Model model){
        return "h5";
    }

    @RequestMapping(value="/actdic",method= RequestMethod.GET)
    public String getActDic(Model model){
        return "actdic";
    }

    /**
     * 登录认证
     * @param in
     * @return
     * @throws AuthenticationException
     */
    @PostMapping("/login")
    @ResponseBody
    public BaseResp<?> login(User in) throws AuthenticationException{
        if(in == null || StringUtils.isEmpty(in.getUserName())){
            return new BaseResp<String>(ResultStatus.error_para_user_empty);
        }
        User user = userService.findByUsername(in.getUserName());
        if(user == null){
            throw new BadCredentialsException(in.getUserName());
        }
        UserBlacklist userBlacklist = userBlacklistService.selectUserByUserName(in.getUserName());
        if (userBlacklist!=null){
            return new BaseResp<String>(ResultStatus.FAIL,"您暂时无法使用该小程序,如有疑问请联系客服!");
        }
        userService.update(user);
        String token = userService.login(in.getUserName(), in.getPassword());//这里的password现在没用了，默认用userName + salt
        return new BaseResp<String>(ResultStatus.SUCCESS, token);
    }

    /**
     * 刷新密钥
     *
     * @param authorization 原密钥
     * @return 新密钥
     * @throws AuthenticationException 错误信息
     */
    @GetMapping(value = "/refresh")
    @ResponseBody
    public BaseResp<?> refreshToken(@RequestHeader String authorization) throws AuthenticationException {
        String result =  userService.refreshToken(authorization);
        return new BaseResp<String>(ResultStatus.SUCCESS, result);
    }

    /**
     * 根据id查询用户信息
     * @param id
     * @return
     */
    @ResponseBody
    @RequestMapping(value = "/get/{id}", method = RequestMethod.GET)
    public BaseResp<User> getUserbyId(@PathVariable Long id) {
        User user = user = userService.getUserById(id);
        return new BaseResp<User>(ResultStatus.SUCCESS, user);
    }

    /**
     * 新增用户
     * @param code
     * @return
     */
    @ResponseBody
    @RequestMapping(value = "/add", method = RequestMethod.POST)
    public BaseResp<User> addUser(String code,HttpServletRequest request){
        //获取openId
        if (StringUtils.isEmpty(code)) {
            return new BaseResp<User>(ResultStatus.error_weixin_user_code_empty);
        }

        /*if(StringUtils.isEmpty(unionId)){
            return new BaseResp<Long>(ResultStatus.error_weixin_user_unionid_empty);
        }*/
        //获取openId
        String param = "?grant_type=" + PaymentConfig.GRANT_TYPE + "&appid=" + PaymentConfig.APPID + "&secret=" + PaymentConfig.API_KEY + "&js_code=" + code;
        //创建请求对象
        String httpRet = PayUtils.httpRequest(PaymentConfig.GET_OPEN_ID_URL, "GET", param);
        Map<String, String> result = new HashMap<String, String>();
        JSONObject jsonObject = JSONObject.parseObject(httpRet);
        if (jsonObject != null) {
            Integer errcode = jsonObject.getInteger("errcode");
            if (errcode != null) {
                //返回异常信息
                return new BaseResp<User>(errcode, jsonObject.getString("errmsg"), null);
            }
            String openId = jsonObject.getString("openid");
            String unionId = jsonObject.getString("unionid");
            /*
            通过unionid查询唯一用户，如果没有查到再查询openId，如果也没有查到证明是新用户或者是仅仅通过手机号在商家端里面注册的用户，直接插入数据即可,
            如果通过unionid没查到，通过openId查到了，则证明是之前的老用户，没有unionId，则更新用户，返回userId给前端,
            如果通过unionid查到了用户，则里面必有openId,再比较其中的openId，如果openId相等的话，则不用更新用户，不相等的话更新用户(更新openId)
            */
            User byUnionId = userService.findByUnionId(unionId);
            User user = userService.findByOpenId(openId);
            if(byUnionId==null){
                if(user!=null){
                    user.setUnionId(unionId);
                    Integer update = userService.update(user);
                    User userById = userService.getUserById(user.getId());
                    return new BaseResp<User>(ResultStatus.error_user_exist,userById);
                }
            }else if(byUnionId!=null){
                if(!StringUtils.equals(byUnionId.getOpenId(),openId)){
                    byUnionId.setOpenId(openId);
                    Integer update = userService.update(byUnionId);
                    User userById = userService.getUserById(byUnionId.getId());
                    return new BaseResp<User>(ResultStatus.error_user_exist,userById);
                }
                return new BaseResp<User>(ResultStatus.error_user_exist,byUnionId);
            }

            /*User user = userService.findByOpenId(openId);
            if(user != null){
                return new BaseResp<Long>(ResultStatus.error_user_exist,user.getId());
            }*/
            User userNew = new User();
            userNew.setOpenId(openId);
            userNew.setUnionId(unionId);
            userNew.setUserIp(IpUtils.getIpAddr(request));
            Date date = new Date();
            SimpleDateFormat sdf = new SimpleDateFormat("yyyyMMddHHssmm");
            userNew.setUserName("xq_" + sdf.format(date));
            /*userNew.setPassword(RandomStringUtil.getRandomCode(6,3));
            userNew.setPassword(DigestUtils.md5DigestAsHex(userNew.getPassword().getBytes()));*/
            userNew.setSourceType(1);  //来源小程序
            Long id  = userService.add(userNew);
            User userById = null;
            if(id!=null) {
                 userById = userService.getUserById(id);
            }
            return new BaseResp<User>(ResultStatus.SUCCESS, userById);
        }
        return new BaseResp<User>(ResultStatus.FAIL);
    }

    /**
     * 通过openId和unionId新增用户
     * @param openId
     * @param unionId
     * @param request
     * @return
     */
    @ResponseBody
    @RequestMapping(value = "/addUserUnionId", method = RequestMethod.POST)
    public BaseResp<User> addUserUnionId(String openId,String unionId,HttpServletRequest request){
        //获取openId
        if (StringUtils.isEmpty(openId)||StringUtils.isEmpty(unionId)) {
            return new BaseResp<User>(ResultStatus.error_param_empty);
        }
            /*
            通过unionid查询唯一用户，如果没有查到再查询openId，如果也没有查到证明是新用户或者是仅仅通过手机号在商家端里面注册的用户，直接插入数据即可,
            如果通过unionid没查到，通过openId查到了，则证明是之前的老用户，没有unionId，则更新用户，返回userId给前端,
            如果通过unionid查到了用户，则里面必有openId,再比较其中的openId，如果openId相等的话，则不用更新用户，不相等的话更新用户(更新openId)
            */
        User byUnionId = userService.findByUnionId(unionId);
        User user = userService.findByOpenId(openId);
        if(byUnionId==null){
            if(user!=null){
                user.setUnionId(unionId);
                Integer update = userService.update(user);
                User userById = userService.getUserById(user.getId());
                return new BaseResp<User>(ResultStatus.error_user_exist,userById);
            }
        }else if(byUnionId!=null){
            if(!StringUtils.equals(byUnionId.getOpenId(),openId)){
                byUnionId.setOpenId(openId);
                Integer update = userService.update(byUnionId);
                User userById = userService.getUserById(byUnionId.getId());
                return new BaseResp<User>(ResultStatus.error_user_exist,userById);
            }
            return new BaseResp<User>(ResultStatus.error_user_exist,byUnionId);
        }

            /*User user = userService.findByOpenId(openId);
            if(user != null){
                return new BaseResp<Long>(ResultStatus.error_user_exist,user.getId());
            }*/
        User userNew = new User();
        userNew.setOpenId(openId);
        userNew.setUnionId(unionId);
        userNew.setUserIp(IpUtils.getIpAddr(request));
        Date date = new Date();
        SimpleDateFormat sdf = new SimpleDateFormat("yyyyMMddHHssmm");
        userNew.setUserName("xq_" + sdf.format(date));
            /*userNew.setPassword(RandomStringUtil.getRandomCode(6,3));
            userNew.setPassword(DigestUtils.md5DigestAsHex(userNew.getPassword().getBytes()));*/
        userNew.setSourceType(1);  //来源小程序
        Long id  = userService.add(userNew);
        User userById = null;
        if(id!=null) {
            userById = userService.getUserById(id);
        }
        return new BaseResp<User>(ResultStatus.SUCCESS, userById);
    }

    /**
     * 根据某个时间段创建随机用户
     * @return
     */
    @ResponseBody
    @RequestMapping(value = "/batchAddUser", method = RequestMethod.POST)
    public BaseResp<Integer> batchAddUser(Date beginTime,Date endTime,int size){
        for(int i=0;i<size;i++) {
            User userNew = new User();
            Random r = new Random();
            String openCode = RandomStringUtil.getRandomCode(22, 6);
            String[] nickNames = new String[]{"lu_null", "fuck", "zippo", "尘", "管理员", "这样啊", "aaa", "测试", "曲德君", "路永", ".", "勿忘初心", "寡人如拥", "小王同志", "时光偷走当初", "浮光初槿花落", "邦sir", "对与错", "旧事离人", "不谈爱情", "入我梦ι", "郭加伦", "张鹏", "locke", "烈酒花生", "王芳", "陈长永", "一休", "饮醉酒", "倾一世丶等一人", "chen", "Eunice", "Joke", "黄烦烦", "栀初", "明海周易", "網絡噓擬", "Henry", "话说当年", "怪我怀旧", "小生", "缠着我的还是思念", "心动情歌", "酒后情人", "藏匿", "周蓉竹", "说了好多", "太极湖畔茶农", "便是永远", "尘世凡间", "花衬衫", "善败者邵德政", "情味三千", "梦醒因你", "你在远方。", "风猫", "一身干净味", "紫", "朱勋", "人情淡薄纸一张", "这年头感情全是走私货", "泛黄照片。", "江涛", "努力努力更努力", "改写着我的情绪∞", "总有刁民想害朕", "划船不用浆全靠浪", "陪你装逼陪你浪", "船到桥头自然沉", "清风伴酒", "剑胆琴心", "久居她城", "独家记忆", "懒得起名字", "连云朵都是爱你的形状", "王亚楠", "叽里咕噜", "老师你比卫生纸还能扯", "骑着羊儿去放狼", "淡若輕風", "离人不挽", "曾Sir", "滴血的黑玫瑰°", "血龙Ψ帝国", "copple", "我要99不要88！", "巨坚强", "炫迈阿桐，@", "宁愿二，不愿装-", "时间掌灯人@", "爱你不需要理由i", "Welcometomylife", "男人站直别趴下。", "奇葩，是一种格调！", "Irony讽刺", "凃聪", "雨食Infante◎", "Owetokiss", "Hurt痛苦white婚纱", "老徐", "Koreyoshi°唯美", "祸水Gentle。", "坟地的黑猫Romantic■", "女人味|Charm", "OneMore", "妄想症.Delusion", "忠意", "Young", "°Distance.距离", "Excuses借口", "独年荒岛-ALONG", "牵绊°sunset", "心动则痛Oath°", "鑫、MW", "心控　2/2star°", "Timeless。落尘", "荒年Memory〆", "空景Sadnes╰つ", "温唇°sunshine", "魔方　-　[magic]", "-夜、行者", "Ninety丶所谓爱情。", "anesthesia麻醉", "/冷淡丨desolate。", "倾城°AllureLove", "-逃荒　Apersonゞ", "Formerly°", "Amour╮暮念", "烟祭smoke", "从前慢", "Promise、爱你", "理科学霸帅dada.", "文科学渣萌didi.", "spiritPsych丶灵魂", "Weirdo", "D.oues-", "Ranagroundヾ", "?Moresoft", "spoilsme宠我", "MarrYme？", "radiance（光芒）", "Everthng", "野心与你", "本王不退位尔等都是臣", "姐的温柔，绝不喂狗", "少年眼眸似深海", "动了情的浪女", "一抹清风醉红尘", "不特别、但却是唯一", "活的像风", "十里红妆", "北笙", "姐就要挑战你的黑名单", "暴走萝莉", "南葵思暖", "陌上花开√醉流年", "猫小咪丷", "天命终不由人", "Thethin.稀薄", "埋葬", "Excess.多余", "卖萌不是罪、", "佛祖请我去吃肉", "跌跌撞撞", "Remain", "未眠觉醒awakening", "obsession痴迷", "*Memory", "浅笑°　Sunshine", "殷健", "Time.时光。", "半颗心Broken※", "董明达", "偷腥的猫Gentle", "薄凉*Armani", "小吴", "Ringfinger", "经年°reminis", "mylight.", "﹏ＰAＬE", "Firstsonw初雪", "重唱ensemble℡", "可怜虫", "TFBOYSo", "Jennifer", "私家珍品　せ", "history", "MyheriMyhei", "H.Rosa丶Star", "Ever丶幸福", "风", "骨子里的高雅/", "农村大代表*", "真材实料的我", "ぁ我的心在向外飞", "象luagh", "^-^Y/ang＿", "姑娘几多情", "古月", "Aoooooooow", "吴浩", "琼花", "黑语", "桀", "初夏", "往事共犯共生", "丑八怪", "南.", "国士无双", "灬沫", "小斌", "灿", "沐风੯ʔ", "声色犬马", "小小小x^_^", "庵上岛屿", "伊莱格小谭", "终点~现实的起点", "@&@", "Jan", "罗十六", "A尚好家居13636272409", "阳光／sunshine", "电脑雕刻加工", "yyq", "余天真", "游红", "胡", "唔吔哎", "迅.小七", "雨点儿", "屿柚", "爱心", "F。", "YinHang◎", "梁小平", "踏雪寻梅", "瓏！！！", "缘尽情未了", "我想去海里看看你的世界", "不玩的秘密", "骑猪笑看人生", "", "蔡大双", "colorfulpig", "ai", "倾城一笑，抵我半壁江山", "侯豪", "33", "方方", "小咪咪", "夜尽天明", "Winnie", "楠槡", "水歌", "左国清", "Millyn", "徐小铨", "杰", "(ノ_＜)", "浩杨", "风轻云淡", "流逝的时间", "啊啊啊啊坤", "蜗牛爱太阳", "邓勇", "王仲贵15827476336", "AA", "葛军-培友工作室", "西行者Westingwalker", "嘿！你的益达~", "李炸天", "钱诚", "随风", "虾飞", "Cason", "IAmFrank", "L'Estate", "迂見♥", "老哥哥", "淼箍", "679工作室:拉票找我13691091353", "风和", "小妞", "轩轩", "杨少辉", "孙辉", "卟忘初心", "敲键盘的猫", "心湖民宿陈美频", "熊丹", "帅帅", "阳光与盐", "桃子", "耿爽", "LiLi", "李海霞", "微微一笑", "鲍支勇131419", "春姑凉", "杏仁", "吴小宝", "独白", "坨坨", "一米八的大祖宗.", "失辩", "柒个我", "奋斗", "王某人(小程序开发)", "A~宛志豪", "成熟了一半的我", "火瀑椒麻火锅|吴龑", "从头改变", "邓南浩", "MAMAMIA", "！", "王俊", "福德居炭火烤肉", "方榮", "袁少锋", "CL", "掌柜奶茶", "刘昕", "郭顺利怀恩供应链17771802777", "o型血", "洪宇", "红鱼", "-宋朗", "溪溪", "泰然", "王倩Nicole", "优惠君", "￡秀￡", "Ｍ@Ｙi", "盧小帅", "$", "小爆", "妄唔", "aesin63", "武当山中老汉", "旋月子焱", "DarryRing", "湜祎.ξ.", "☀☀", "汉口北*^O^*老陈", "肖", "努力奋斗", "欣", "冰池晶荷", "贾江伟", "麦子", "高山流水", "何智刚18617368190", "鄢禹正", "奋斗的青年", "预知", "木子", "张鹏测试", "。", "Mr.black", "空谷の幽兰", "夏鸣泽（文君）", "左萍芳", "初见", "原生态", "马大忽悠", "miracle", "克斯维尔的明天", "安雪莲", "蘭蓝兰澜", "青稞小白", "SmokyQuartz", "GMManson", "子语", "小子", "Rôle", "灵芝蛋蛋", "白嫖高建国", "Haha", "叉叉。", "江江姜", "天使MM", "邦Bang", "你", "好巧！原来你也在这里", "一只屯食的大考拉", "不矮", "忘了忘记你", "勇哥", "DQ--丹琪", "土苗风情：殷望春13554496936", "小蘭", "蒹葭", "啵啵啵玻", "曹金鑫❁҉҉҉҉҉҉҉҉", "汉山城老火锅OW", "（江滩.印象）王文波", "24K纯屌丝", "悸动", "知知", "斑", "www.", "沈轶圆", "SQ", "山阿妹中国", "李明洋", "喔唷喂", "以笙", "哇咔咔", "蓝山", "舅舅", "半庂", "莎莎", "望京邑", "Vivi", "珊珊真滴好", "蒋蒋蒋", "sandy", "极限", "马猴烧酒瓜兮兮", "永学", "郭继辉-餐饮顾问", "1948校友创业咖啡", "acoolkid", "云淡风轻", "doublerainbow", "Zzzz1025", "浅忆", "小、龍", "桓某人233", "十二", "love", "dream&happiness", "纯纯的傻丫头", "天若有情", "YuoJyafai", "呜嘎嘎", "Don", "离家小孩。", "陈荣鹏ō", "Pink_pigpig", "安家铜门13777969919", "Clheathen", "浅忆", "@-@", "武汉基友咖啡", "彪炳千古", "Yee", "狄先生", "娟子", "没品的文艺青年", "来年", "浮世清欢", "Komorebi", "格致", "娇娇猪", "ねぇDarling", "卖女孩的小火柴", "Vera", "一路向前走", "QuincyLaw", "罗子恒", "Lee。", "清旖", "Excess", "小葫芦", "上善若水", "Anesthesia", "孤痞か", "kkkkkarroy", "哏哏.", "Gun", "Desire", "佳佳", "许墨", "SJH", "自在极意", "张升", "木子", "Sally", "温妤", "胡图图", "烊光真好", "仝尘", "CACcoffee陈聪", "jiojio唐", "张威小团圆餐厅15972061929", "心船", "₍˄·͈༝·͈˄₎ฅ˒˒", "小仙女", "肖遥", "Mooke", "特色酱椒鱼", "余生请指教", "春物", "牟博士", "王小贱", "橘柑橙柠桔柚灬", "华", "DrewerainChan", "熊吉君", "唐清清麦里", "Jim", "芍药居谷", "จุ๊บLilySwan", "开心过好每一天", "温情", "i", "胡俊丽", "babi5", "youngforever", "瑾夏シ", "河流", "糖", "莫ベ唸", "周远春", "", "浅蓝色", "苍术", "安好@", "乜嘢", "风铃", "秀", "Mr.姚", "炽钥", "夏夏", "多肉uuuuu", "浪呀浪☀", "小菇凉！", "攀~", "小姑凉", "阿诺", "QQ餐厅", "菜根香生活菜馆", "酸菜泡咸鱼", "小雪雪", "浅忆", "呆萌萌", "某某某", "花开半夏", "点点滴滴。。。", "阳", "周光蓉", "无心", "小胖子", "A0郭场鸡陈乔13477113739", "人格失窃#", "LemonTree", "映花", "rdgztest_65958", "谭业文", "Wenzhi", "渡千山", "下一站、幸福", "欢辣派重庆老火锅", "@源泉", "一切淡定", "小团圆15926477840", "JJ", "刘正奇", "樱花，烙", "刘琪。", "流星", "大任如山", "馨子", "lu_null", "“1998”", "柳生", "阍者", "随便家庭厨房", "以微笑面对*", "陈月生华", "晓不得", "白海飞", "魏洪敢（老乡长餐饮）", "老周", "家常味道", "韩波", "有你的旋律", "川香阁", "艾尚美食坊", "色难", "A武汉炽履-席振兴", "黄正权", "欧阳", "ameng", "收藏起你的帅气ゞ", "万事随心", "宝宝", "JD", "落英轻狂", "约定。", "晓筱", "柯倩小天使", "小林子", "阿子", "chen", "ever", "yo", "。", "rdgztest_UKXPPP", "田航本", "阿尔菲", "隔壁家那个男孩", "遗。", "丽丽", "NOZOMI", "秋月白", "阮田瑞草", "干净", "菜柯西", "珍珠烤奶三分糖石锅拌饭加颗蛋", "迗嘫槑", "黄继虎", "西子", "Grade", "达卡", "涛声依旧", "杜若溪", "理论", "预约", "华丽", "春风十里", "中的故事", "马步鱼。", "秦时明月", "流星蝴蝶剑", "华灯-初放", "稻花香-", "力度", "沈鑫", "坦然", "小感动", "明恒", "傻小子~", "summer", "关凤", "の失去", "显强", "徐悦", "小红点", "佳佳", "无问西东", "心结", "Lock", "嘎嘎嘎*", "相濡以沫", "余琴", "心花怒放", "奋斗", "今朝…", "曹华东", "芊妍", "一份信任", "小北。", "顾玉芳", "张安", "鑫谷", "发发呆", "喵喵喵", "离开", "小城", "清清", "繁华一梦", "安静", "嘤嘤。", "王晓", "苹果", "海南百川", "依依", "李华", "城南旧梦", "/(ㄒoㄒ)/", "哭", "温暖", "刘洋", "金戈", "王涛", "七里河", "花香", "梵蒂冈", "东哥", "菜菜", "wt_code", "God", "偌言", "胡小婷", "babyone", "三茅", "印记>", "刀光剑影", "韩束", "好烦=", "datab", "刘广", "曲美成", "青云", "包佳俊", "坦然哥", "Oa倸", "TT", "Dub‘", "付羽2", "杨洋", "落霞", "秋色", "十里桃花", "三生", "李莉莉", "张古绝", "醉月点心", "张旭", "陈晨", "徐光", "冬冬", "星光", "流年", "曦月", "长恨歌", "陈石", "赵元", "初心", "山水人家", "沁香谷", "春风", "奶酪", "南风日化", "担任", "ningjing", "黄山", "醉梦", "万能器材", "蕊蕊", "garage", "Roger", "陆勇", "睿智", "刘峰", "oOoOo", "棋坛大师", "东兴", "蝶舞", "大是大非", "川福", "诚诚", "科技发言人", "畅畅", "长沙", "扫地僧", "徐源", "HY.", "朱福陈", "珊珊", "李玉波D", "广富林", "元青花", "Hyrder", "肖宇航", "G", "chenchan", "repetition", "赵启成", "Jim", "馬栝", "孙冬梅", "小妍妍", "Spring", "·鸢尾花", "路会盼", "玲珑花-", "#狐狸", "hellokitty", "袁希滨", "qing", "飞燕归来", "郭丹", "宋姒", "叶青", "dotaKing", "陈琦", "神采飞扬", "贾学斌", "Jeep", "笑若扶风", "赵妮", "1873莱", "舒诚亮", "心*心", "魏柯", "封神", "红颜", "舒心", "江剑", "T涂画", "王通", "司马", "囡囡", "嵩明", "万博文", "蒋健", "蕾蕾", "邓念", "尕尕", "stat", "洛璃", "悠悠", "呱呱、", "神话", "(*^__^*)", "Yuki。", "Ghxz", "举头望明月", "锦绣", "森森及", "一休", "轻轻", "东升", "闹闹", "潮汕美食", "紫萱", "无名", "李青山", "张越", "湖光潋滟", "发呆", "趣味", "肖珂", "故梦", "夕颜", "龙三米", "尊主", "陈吉昌", "广哥", "日夜渐胖", "₩达拉Sean", "兴成", "哈喽suti", "罗曼", "®㍿℡ⁿ°°°", "周小姣", "指南者", "刘桂兴", "夏文雄", "王小平", "狂野的青春", "深深几许", "吴丹", "何茜", "李树鹏", "成远山", "五月", "蔡建民", "你的信徒", "众志成城", "希哥", "蜗牛的梦想", "高高欧尼", "aH", "沈大师", "王美玲", "芳芳", "玩心", "邓某某", "开心果", "重庆江湖菜2-2~1", "方老板", "梦中想着你", "长江一号", "yy", "邹长锋", "彼岸", "霞霞", "南柯一梦", "李勇", "朱志雄", "花花", "川香四季", "永恒之心", "雨中飞花", "阿芳", "艾米", "徐永涛", "Ami", "陈曦", "王娜", "常思思", "赵畅", "温溪", "邓力", "Smart", "徐小玫", "科创中心", "夏老板", "何梦", "王某某", "长河", "古方", "徐苗", "江英", "Shutdown", "季攀青", "黄雨", "张晨", "辉煌", "锋利", "艾尼", "云", "小悦悦", "李丹", "醉", "扯淡。", "小毛驴", "稼•̀_•́轩", "王小琴", "Jerry", "瀚森", "洞悉", "李晓宇", "心酸的浪漫", "心花怒放", "郑新言", "沐沐", "卢红玲15972172900", "公孙胜", "清风佛来", "诗沫沫的生活", "•C•", "吴用", "柴进", "H", "心随你动^O^通吃", "2018", "这还要昵称啊", "何以飘零去", "风中的一匹猫", "爱婴堡母婴馆", "L", "学术出版人|覃（qin）未来", "蜗牛", "三小姐", "卢俊义", "雷迅", "鲁智深", "Ee", "辳耕烤全羊～华少", "盲眼", "G_C__", "阳", "L", "默", "为中华民族伟大复兴奋斗中", "日月星辰", "杨栋", "test兰陵", "简学雅逸", "不随意", "????", "浪子", "七月七", "吞吞吐吐", "前方定当是美丽的", "思诺", "符念ꦿོ℡DeosaL丶ravke", "天时饭庄，罗田吊锅", "哈同", "开荒人", "几分", "呼延灼", "。。。", "太仓万达-文豪", "浩宇", "长虹", "航程万里", "yyy", "罗明", "自省", "热锅上的蚂蚱", "我喜欢秋天", "ZacH", "大魔王", "弯弯弯", "小雨", "黎明之光", "小希·", "陈晨", "孤独一神", "曾礼", "美华", "徐卓", "默。", "假装淡定", "*^_^*", "若尘", "ting", "温存", "杨志", "　", "置杯久茶淡香早发", "兮木", "@(^_^)任莉", "好好说话", "云哥", "磊怪��คิดถึง", "张景虎【张小厨经典肥牛】", "小易", "天赐酒家柏巍13635715365", "Mr.Wang", "测试", "随风追梦", "是肉松啊", "A*陈厨", "为萌神", "凉玖°", "A你我同行创造未来", "momo能量水晶", "王微微喂喂", "风猫", "偷得浮生半日闲", "金天柱13872788174", "禪訫", "木头", "然也", "白羊", "宋江", "1988", "小涛", "金圆宝", "三生烟火", "韩玉兰", "温妤", "A-卫华", "十堰陈记炭烤肉", "汤玉明：15172283909", "AAA高兴", "风猫", "红红火火", "飘思蒲公英", "圆心", "我好累", "紫陌", "喂丫丫", "笑笑不说话。", "苏墨fox", "赤果果", "上元瑞合人事陈", "执笔无一字", "玖月", "良珍", "黑伢", "��小妖爱��王子��", "papillon", "搁浅", "Angela", "忘忧草", "ソ静待花开べ", "阿青", "-", "清", "知足常乐", "杨迁", "退休的神奇女侠", "落日海湾", "Jay吻", "如果我是迪杰", "风猫", "A文磊い『皇冠』", "茂连＼m.maoliantea.com", "风猫", "麦粒儿", "满堂红", "随性且迷人.", "美佳淳轻食朱峰", "郭琰", "林深时见鹿-", "李应", "杨虹", "哼哼唧唧", "凉城以北深海未眠", "丁万涛¹⁸⁶⁷¹⁹⁶²²⁸⁷", "静心", "玄妙飘灵", "张清", "琳子", "华美", "胖虾哥（郭涛)13997829493", "欧阳文成", "何林", "LUCKY", "臻璨", "残梦忆他深巷空°", "CHLOE", "秦楚吾言¹⁸⁶⁷¹⁹¹⁵³¹⁷", "如雪", "小汤圆儿", "朱辉", "原味坊酒店", "彭家毅", "燕子", "笑看人生", "ζ终遇你ゞ", "美佳淳台湾轻食", ".", "闫雪", "黄艳", "离心", "X", "刘波18971918919", "四方（志清）百货酒店用品", "拼搏就是幸福", "青颜", "　　", "爸爸", "成", "王方鈺", "詹斌", "秦楚风", "暂时无法查看", "时光静好彼此安好", "霞李¡", "满足就好", "小艳儿", "上海路金座满山红馥溶小小", "玲珑秋月", "余其国", "小确信", "厨", "陈", "花荣", "满山红生活菜馆", "A李波", "爱善天使芬芬", "龙门阵", "蕜乀伤述詤霺笑", "童年的回忆", "糊里糊涂", "。", "现实里*^o^*的童话", "不期而遇", "陈凯", "香莲宜嘉餐饮陈真", "比尔邓", "CarloShi", "任行群", "娇", "孤单", "Gina·吉娜", "会飞的兔子", "つ微凉徒眸意浅挚半", "凯楠", "乡里乡亲菜馆", "家家宝小赵", "心碎情殇", "悦儿", "阁幕之下", "lu", "花飞残雪", "青青", "马自明", "心雨", "碧水寒烟", "么么哒", "覃伟18771942998", "高听", "琪宝宝", "改变命运追求自己的目标", "随缘", "唐朝时代", "龚怡霏", "柳柳", "周杨【圣商】", "彬彬有理", "赵伟", "杨洪琴", "_._木木每文。", "云～私人订制韩式半永久定妆术", "正在启动", "享七美食-曹志", "雄大叔", "王义兰", "出水莲", "果果", "滕波", "嘴角残留的笑", "A吴妞妞", "航", "。。。", "王传敏", "鹃鹃", "张丽萍～", "喜欢就抢", "~", "安于此生~", "汤老大", "子木", "晨晨@十月", "彭", "安然", "柠檬鱼", "AA幸福快乐", "王莉", "小燕子", "湘宴2017酒楼小曾13733558409", "吴吴", "湘宴", "ヾ情深丶缘浅゜", "屿凤.", "锦瑟幽心", "灰太狼", "沙洲", "♚₯㎕。Smile⑦哖", "易以东", "小笨蛋", "浮生若梦", "谁懂你面具下的忧伤", "封心锁ai", "随缘", "哥已成大叔", "yuebancanghai", "赵久云", "待到山花烂漫时", "爱不起，恨不起，感谢你的空欢喜", "酱紫呀%", "代磊", "湖北十堰五堰商场[时尚先生生活馆]", "流年无悔", "丽、系疯子，，", "心忘则亡", "好好", "人生不易", "钱慧", "花果星语汽车服务17671116879", "小翠", "孙传芬", "珍惜", "洛阳硕力信充电桩周恒", "消磨时间", "鹏鹏", "张鵬斐", "远洋", "我心永恒", "武松", "明月/天涯", "陈姐", "荆州金佰特酒店工程黄18986666689", "昕林", "易家晓仙女", "安静", "沙漠绿洲", "安然", "一笑而过", "candy", "小雨点^O^", "幸福一生", "宋玉婷", "FANBOCHENG，", "LOST", "(๑思考๑)", "杨老幺", "一本万利", "清风", "青稚ξ", "༄ྀ滅絕師汰༄ྀ", "王元娥", "橙子tj", "꧁贝店邀请码308609꧂", "刚好遇見伱", "夜微凉", "可乐", "檷檬", "镜子@刘文静", "阳光", "燕林市场伟星地暖张瑞", "袁艳18071367668", "澔", "LSC", "小豆米-杜鹏", "小南", "哆啦弯弯", "天空", "李欢", "清泉", "琴筝", "凌風", "会飞的鱼", "宏胜科技_田超13040909539", "钢哥", "静静", "晓心", "A0齐同涛17707167112", "请叫我大王", "张磊", "Summer", "失恋的雨", "离", "花朵朵", "欧文庄", "闪电蜀黍", "曾义秀", "十堰乐松珠宝陈先生【支持转图】", "泽子", "郭英", "640", "努力奋斗！罗贵平", "贺荣云", "，", "叶航", "孤酒浪人", "走哪了", "女王らRose°", "蒽", "艾米", "Tiger", "王LM", "罗小小", "夏天", "虫子", "顺其自然。", "冲Uncle", "A汽车轮胎轮毂销售13997802166", "卡其ing", "かTrosl*", "不忘初心，方得始终", "初心", "@_@", "양미", "飞花梦影", "向左向右", "硕硕Eric", "星仔", "擦肩的落叶", "暮雪白头13971926738", "　　　　　", "活者", "洋葱卷", "陆陆", "李荣", "野马", "觉百行皆非", "半面妆", "李晓明", "...吾不是善人", "渡河", "不再…………", "卍拼命赚钱卍", "红太娘", "Miracle.", "︶ㄣ暗｀影╰", "邓有志", "姣", "上善若水", "✎﹏:♥", "徐海", "佳佳", "地球那么大我想去转转", "春风", "Crushonyou", "月亮", "在希望的田野上", "万川", "雷你嘎嘎", "鱼饼呐~", "88潮牌天艺美业创始人---胡子哥", "闲花应笑人", "心辰", "川流不息", "周先生", "rdgztest_92072", "南方小羊牧场", "纯、子", "十堰～大渝今飞", "云淡风轻", "lzylalala", "曾经飞过", "''、ting.", "bryanqian", "Vailee", "Krystal٩(๑^o^๑)۶", "可子猫", "义", "30岁不到a", "徐柳雄", "小寒", "张帅", "李淑琴", "享受每一天！besos", "钇北辰", "黑杰", "訾田田", "凉笙西辞。", "道法自然玄之又玄", "吊桶客", "海纳百川", ".", "阿钟", "雅俗客（汪从军）", "洪江装饰", "小五子", "周吉平", "红尘舍恋", "不忘初心@", "娟", "Smiley", "燕子", "冬梅傲雪", "邓娟", "花儿朵朵", "孤独的浪漫", "稻草人", "洙帝", "贾晓玲", "簡單灬愛", "郑宏", "f.f.", "紫川秀", "郧县家银会计培训中心", "一休", "君莫笑", "julie", "滥友人.", "李不二", "路路", "飞哥", "祥云", "彤心无尘", "琴琴", "川椒王顾广骏13677191413", "曼珠沙华、", "渐行渐远", "...", "张志-中国", "帅鑫℡¹³⁵⁹³⁷⁷⁷⁷⁸⁹", "橙子", "刘毅", "五堰辣椒王酒店", "bvvvvc", "魏风杰", "九田家胡斌14747332322", "紫菡", "LJF", "深海鱼", "黄娟（米高林·铁板厨房）", "少年的阿斌", "蔚蓝冲浪", "ai你一生", "孙华", "简单生活", "歪蛙小丽", "快乐宝贝", "少年的阿斌", "@柠萌！", "XYZ。。", "毛将军", "素颜为了谁", "X@_@X", "王军", "最熟悉的陌生人", "雷赣@Teamo", "花昔", "Alvin", "Alice", "武陵居士", "安洛落", "曹燕成", "黄新", "我", "qwq", "小月", "陈信", "黄正蓉", "Mr.吕", "见贤思齐焉，", "杨美龙", "李伟男", "柏彩霞", "维他奶", "园园", "果果", "喜凰桐18081979211", "blank", "张贺鹏", "mesut", "李江", "唐英", "琦月", "娜一片天", "鹿爷", "QN", "柳先笙", "Mr.Sui", "喜虾客", "嵩嵩、", "德行天下", "刘玲", "FUGE", "优游", "极Theo", "龙在天", "刘.Sir", "1340", "xuan", "心晴", "郑伟", "凯里建设银行廖宗煜", "侠行客旅游网李剑", "偶尔有点小感性", "詹妮妮@36氪｜赶稿中", "Timliu", "冼峰.闷倒驴", "Samye。", "果粒儿", "话不多先生", "052", "张永", "♚", "海绵宝宝", "陈龙@alex", "mesa姚", "阁楼༽", "____左岸以西", "清风", "小余", "安稳.", "冬阳", "尘", "遇上你是我的缘", "青田禾木", "刘英", "洪竣平", "战神", "一叶知秋", "ZL·", "余小波", "大仙", "兴中", "Eric", "風不曾停息", "程志沅", "戚涛℡18871971077", "M马渊", "闻涛", "賀金夆", "水清如许", "金座虾球王18972501220", "慧慧", "兄弟快餐小碗菜", "贵在坚持｜阮生", "wgl", "郑氏有良", "养生美业共享生物链-守护天使", "大米饭", "豆豆~呐", "姜宇航", "Sunshine", "芳", "盛龍Senlon", "没有背景只有背影", "邻家土钵菜", "政哥", "天福源私房菜（晴为何雾）", "马里奥@-@大叔", "冯明军", "A0外卖狂人", "朱重八", "倩爷", "A随遇而安", "WEN_", "Xyang", "配资翻转人生", "银贝餐厅孙君琴13872815031", "真不讨喜。。", "赵", "殷子", "1.2.3...", "秦明", "Ps.", "鹏木兮", "安如少年初如梦", "红红嘿嘿", "A谢俊展", "墨子", "彭一一", "A王佳", "王焱栋", "敏", "放飞心情", "NL", "椛_已凋谢‡", "Dee", "wo只为遇见你", "。", "而立涤生", "江伟", "zy", "听风", "晓静", "劉校箐", "笑敬过往。", "温暖的背影", "辉杰", "力力", "ww", "张军", "张波", "小样儿", "A太平洋保险", "(十堰)社会强信息服务中心", "llıllı雪琴༒", "AAA源动力集团线上运营Tony", "刘南", "黄虎", "伟红", "记忆的永恒", "莉莉", "绾绾", "张志锋", "静静", "驰骋", "朱峰", "幸运草", "合懿", "萱（春）", "兰花", "欧阳博涵", "烟花雨", "王华山剑", "张小红", "苦叶", "淡泊", "cxh", "方强", "刘亚玲", "涓涓细流", "梦之雨", "4F刘艳", "晴天", "樰儿", "李晖", "胡梦军besos", "黑白&记忆", "杨瑾", "杰", "蒯", "谭东凯", "燕子", "百合天使", "甜甜圈@乐乐", "糊涂仙", "熟悉的陌生人������", "Mm", "红姐", "努力努力", "毛梦", "小橙子", "arita", "姚艳", "幽兰", "一切随缘", "坤哥", "TOMATO", "金凤兰", "随心远行", "失约萍", "化丽", "曾", "杨海燕", "童淑琼", "辣条小王子丶", "枫叶", "孙宏闯", "许HY", "丶。僬點男孒", "魏倩", "#^_^#芳芳", "晓翰", "徐东国美胡杏芝", "安妮", "凉茶", "拾柒", "四月", "覃筠", "卉儿。。", "夏燕琴", "无愧^于心", "和你一样", "镜花水月敏", "龚燕芳", "尹兴山", "诚成", "左春芳", "涛", "波伊雅克红酒Mr.胡", "青", "吴惠", "静好", "Abby", "WILL", "你午睡了吗", "mary", "肖凤英", "晓敏", "带刺的玫瑰", "喜阳羊", "武汉站。TST.免费招代理", "R.", "沉默๑", "李红霞", "文文", "慧慧", "Lk", "芳", "非非", "月河", "周大红", "薄飞", "心雨", "！", "花儿", "磊磊磊。", "文力", "涓涓细流", "夏天", "云", "九九", "淡然", "徐东国美-邵艳华", "易唯", "汪芊妤", "芬", "A0饶青斌+15871441997", "飘落枫叶", "月光协奏曲", "吴亚芬", "群", "星辰", "黄丽娟", "Over", "千城", "木木夕", "ASKA", "涛声依旧", "Trust.M", "吴秀珍", "柒月", "纤百灵", "老许", "阿鹏", "谕宝", "晴空万里", "滢滢", "带刺的玫瑰", "木子妈", "闵姣", "～宗宗", "贝壳", "周文莉", "海霞", "阿容", "FanFan", "星愿", "老二黄汉清", "海阔天空", "雾里看花", "琴琴", "琴琴", "开心果", "零时迷子CC", "方英", "LH", "似水流年", "糖果", "方玉", "小猪", "戴旻", "刘云云", "袁志云", "百合花", "景姐", "晚晴", "张红明", "蒋作兰", "侯侯", "天佑cium", "反神", "慧慧", "余燕红", "我爱宝宝", "袁芬", "素颜", "小鸥", "一叶知秋", "liu～丽", "A00梅子ray（云集电商）", "新疆", "白云", "Super_杨", "张曼琳，", "A思思", "猪小妹", "李琼", "candy", "韩洁", "熊熊", "梦开始的地方", "定媛媛", "云淡风清13094181553", "流浪的高压锅", "凤", "周昱含Joyce", "J", "joy", "高玲", "...", "亮晶晶", "Apple", "本", "蒋晶晶", "水果@辉辉", "&纵横四海＆", "供暖达人", "龙哥", "月华", "XXX", "*^O^*蓦然回首*^_^*", "波少", "古灵精怪", "慧明", "方", "刘红", "匆匆那年", "荒荒", "你是流星，我是雨", "玲玲", "露露徐东", "珍", "石岚Lan", "云云", "何娅玲", "小敏", "莲", "毕兹卡@土巴", "阿星", "Yj", "秋梅", "啊芸", "啊华", "82年雪碧", "张小芳", "烟寒若雨", "芸", "玉洁", "妮可", "꧁萍꧂", "肖娥", "无语", "卢秋运", "小草", "丹～", "成", "hua", "周", "果栗珍", "请叫我平（）哥", "赵军", "，，", "晓晓", "龙果", "0.0", "芷岸汀兰", "芬", "绝处逢生", "长工", "小雨石", "方红", "A龚胤祥", "钢钢", "国鑫", "芬芳", "蝶舞成％殇", "王艳15342349679", "杨阳", "陈霞", "姜景文", "Arong", "祁红伟", "余红英", "LLLian", "缘", "出流", "可可", "水中月", "张明华", "维维", "我是风儿", "风好正扬帆", "徐东国美王春风", "木朵朵000", "妮子", "万花筒", "苏苏", "余洋", "张卉云", "小绿☘", "张萍", "嘟比妈咪^0^ママより", "小陈", "潘潘", "姣", "墨荷", "巡行", "Cure_line", "孔艳梅", "芊芊@洁", "严香", "恒❤️拼搏", "黑色星期六", "袁静", "老夏", "【达人生意贷+房贷】彭明", "心雨", "金色年华", "A-黄志伟", "T17-32号商铺多美依洗衣店～段宏鹰", "慧", "文文", "黄琴", "明天你好", "苏妮", "杨凤兰", "Yam酱ᝰ", "风轻云淡", "于事安然.", "星星", "心田", "李超群", "叶德秀", "月儿妈", "戴华", "春", "MAN", "许美华", "黄红艳", "李冰", "李超", "翱翔", "冬日恋歌", "海蓝之心", "简单...", "黄玲", "勇哥", "小伊布", "彦彦", "哥，犀利", "杜艳", "双双", "晴天", "oppo王新平", "武文斌", "折李", "汇智尚福客茂工贸华帝卢慧芳", "梅", "王涛", "美菊", "陈晶晶", "开心", "A01陈昌龙", "雪", "xlf", "菜菜子", "牛子源", "江金楠", "汪传文", "阳光", "杜鸿均", "Nita", "俊俊", "D@T&day", "雨中鱼", "传奇", "好奇", "李旭峰", "显", "姜芬", "烟花易冷", "册除我。心痛么。。", "心有所系", "Patty", "刘刚", "_", "fickle", "俊秀的琦莉", "，枫，景，", "L~李", "肖杰", "恵", "汪亮", "梦幻佳人", "mature", "小新", "Hermione", "四叶之晴", "玲玲", "不忘初心", "对方正在输入...", "晓乌龟妈妈", "汪锐", "众木成林~冷彬", "朵朵花儿", "雷芳", "古哥", "MING女人秀", "阳光下午茶", "流星雨", "A0魏德俊15171442070", "Mr.吴", "中国移动-徐东营业厅", "swei", "琴海", "shirley", "程程", "戒烟吸毒", "梦梦", "晓商", "醒着梦游", "中国梦，我的梦", "这就是网名i", "激光气动打标机", "werjin", "方方", "陶丽琴", "*Comète@larmes", "云起", "只争朝夕", "笑三少", "粥焘", "哆睐咪", "restart", "林环珍", "Kosame", "梦寒", "༒V༙྇i⃓n⃓c⃓e⃓n⃓tཀ࿈", "刘露", "醉青天", "康宝厨电~袁响伶13554305549", "宋菊", "莲", "a.胡", "苗爱@永恒", "邬莉莎", "月儿卢晗彧^_^", "邵波", "星盛传媒向兰", "小静", "严钇", "夏天的风", "万和，胡萍萍", "永恒的幸福", "宝贝", "清风", "李博", "郑华", "我一直都在樱子", "ོ荷荷", "壹切從心", "芳芳", "英", "缘份", "艳", "������������������盛红英������������", "苹果有点酸……", "钟萍15807182241", "龙共飞", "求是堂主", "小蝶儿", "冰心", "谭红权", "冰雪", "喻桂华", "高艳妮", "零点天堂", "鱼与熊掌", "陶子姐姐", "雅梅-Cici", "。。。芳芳", "林玲", "____于是的于", "婵.NU", "老钟", "谭玲", "MrBean", "翩跹", "浮云", "笨笨鼠", "刘霞玲", "淡描向日葵的微笑", "雲香堂主", "Kk", "acho", "莹莹", "Hคิดถึงคุณ", "开心果", "阿西吧", "?", "廖玲", "忍者之心", "慧Sir", "闲庭信步", "高明友", "永", "江江", "胡治宏", "丁立", "江灵辉", "敏宝", "`我命由我不由天", "王明芳", "嗷~小.灰.灰", "张伟华武汉仁安眼耳鼻喉医院", "仁安医院~楠哥！", "明天会更好", "阳光", "心雨", "华华", "燕燕", "lanjian", "皓可妈", "A中冶39·大街胡天阳17621933534", "罗权", "眺望", "桂林", "DoU_伱所鑀..", "江寓-廖永涛", "Smile", "若兰", "海阔天空", "肉多多", "胡丹凤", "李浩林13407128625", "鑫鸿海友谊大道格力才茂街86711300", "才华街芦荟专卖曼琴", "芳", "惠子", "威儿", "唯我独尊besos", "马鞍居士", "阿咔、", "李蔓", "陈y文", "芙蓉", "叶琴", "陈娟", "胡莉", "文华", "峰", "差不多先生。", "鲁华", "娜娜", "momo", "驾校", "—Yuan-I'm", "勿忘我", "蓝色风暴", "肖老师", "平平", "Drimary", "念", "狂欢男爵", "淡定", "刘玲15387002707", "Trust.M", "东方韵让你变美变健康", "Mr.yj", "元元", "天涯", "安安浅浅°", "王嘉敏", "@海阔天空", "马小妹", "玲子", "萌大铜铃。", "李建明", "邱鹏", "谢彪", "雷建军", "刘伟--掌上十堰--15586898889", "诗书慢卷", "曉o∩_∩o", "刘辉", "oyjl", "yuhui", "青萝依旧*", "wpz", "A龙鼎武道教育集团～田老师", "秀云", "不离不弃", "唯品会-品骏快递牟来旺", "李禄忠", "木子", "Shirley", "卞卡卡", "敏敏", "薇薇", "LH°", "@Lynn@……", "卧茶嘞", "杰哥", "毛毛", "hemu", "韩威", "创客汇-道荣", "Julia朱莉娅", "非常", "陶陶", "烽火戏诸侯", "Asummer", "初夏の雨", "燕子", "天龍", "先知", "很酷", "菜花花", "劲舞", "A琪琪美容", "CeciliaGao", "Justlikeyou，", "远方", "邵燕芳", "影子月", "健健", "枫枫", "叶罗丽战士齐娜", "老熟芳姨", "日月同辉", "小兔儿", "王煜Revolution", "广汽传祺．廖〔＊〕波", "༒抽༙྇离༙྇༒", "峰哥", "arlen", "附近免单·朱梦凡", "赵虎【顺丰小哥】", "销品茂-名发世家-9号刘锦刚", "平淡", "金雪儿", "黑珍珠", "50后（23-1），", "66", "何国芳", "a付义林_光强化工18171191125", "Z", "美洋洋", "婷子", "活着", "难得糊涂15115736183", "满袖盈清风，罢做莫休。", "老刘", "姚姚", "陈荣", "群群", "玟玟", "芊芊", "香香", "蔡蔡", "文雯", "@向日葵@", "何小毅", "宿昔", "英子", "袁小圆", "玩物尚志爱宠club边牧繁殖", "月尽£风凌", "高，实在是高", "妮筱柔", "陶陶", "雪荣", "杰杰的杰", "王蕊", "何文东", "斌", "Iris", "程莉娜", "凡尘", "妮波", "Real*", "WANGJQ", "豆豆姐", "香黎", "WillWei魏全民", "然鹅干我男神", "Powerstation", "玩偶娃娃", "龙鼎~刘教练", "丑丑兄", "ylj", "yzq", "刘芳", "虎", "jane", "浮萍Cap", "Mei梅", "沖", "方婧云", "彩虹", "海英", "万婉", "李强胜", "云淡风", "拍照达人、", "静", "桂勇", "薇", "陈亮珍", "楼客", "吴静波", "Seagull", "俊俊", "东阳海尔冰箱售后经理曹立祥", "名花有主", "吴丽霞", "低调", "喜洋洋", "华华", "4131", "梅子", "向新荣", "四爷", "陈瑜", "我为爱疯狂", "简单", "金木浴疗~苏璐", "马月琴", "中央戏精学院院长", "缘", "冰冻西红柿", "小恶魔", ".", "薛丽", "Jay迷baby", "黍离", "王志红", "邓念秀", "吴晓玲", "陈先平", "", "萍水相逢", "任雁", "行", "吴悔", "刘晓霞", "平天", "～阿Q~", "随缘", "胡静", "興樂", "梅梅", "有来有去", "陶子", "叶子.", "高峰", "织锦园服饰", "强", "灵芝草", "小园香径", "Hanning", "-L-", "苗苗", "zhihongzhai", "淡然若水", "刘纯安", "君君", "曹京顺", "唐宇峰", "若冰", "爱我别走", "凤", "鹅蛋脸", "大沈", "_✿.时光", "刘进方", "初~心", "三草两木", "ABC", "　　　　　　　　", "彭冲", "！", "余姝筱", "Sammi", "了了", "米兰", "惘闻", "静默如初&玉琢", "Mhx（＊＊霞）", "风中雨荷", "赵文延", "陈玲霞", "公子强", "GWL", "江心秋月白", "婉", "雨中花", "In家伟", "LZGGO", "彬", "Y.x²⭐", "luces", "Memoryoffish", "孤鸿", "李红旻", "章鱼", "西西公主", "闭月羞花", "朵朵是俺闺女", "森林", "李凡荣", "琦大大", "东湖岸边", "grace", "刘嘉韡", ".Iris", "玉萍", "浸在玫瑰的红酒", "须弥而|店长|青青", "Rosa", "鑫裕烟酒", "段毅", "欣颖", "对方正在输入.....", "毕万英", "魏小小", "繁华落尽、如梦无痕", "柠檬绿茶", "胡建刚", "陈莉霞", "张涛", "远方有家", "春雨", "脐橙", "支琴", "狼王", "猪哥亮", "剪剪风", "与爱同行", "盛夏是疯子", "汪菁", "李红英", "阿春", "武汉婚姻律师关欣", "Tempt", "老邓", "HJH", "富哥", "joy苗", "丁丁", "dxm", "z", "心宁", "怪味豆", "青", "玉生烟（袁志武）", "", "往事随风", "three", "焉知鱼之乐", "kiki", "pcg", "娃娃鱼", "松松", "Nice", "小兰", "天使在人间", "向婷", "释然", "谜底，杜倩^_^", "小姿", "程金娥", "谜底，思静^_^", "黄小莉", "莎蔓莉莎", "金逗逗", "栀子花", "李小红", "計洁洁", "lili", "刘克斌", "TIDE潮点沙龙创始人阿斌", "风信子", "甜的很正经.", "杨芳", "华", "有你就好", "嘘，安静", "文文", "毛群英", "贰月", "CHEN", "BIGMAMA", "雷明波", "小叮铛", "成凯红", "霍涛", "王威", "幸运星", "GoldJ&T", "鳕", "天天", "英子", "荷晶晶", "真真假假", "赵芬", "周丹~中国平安", "…遥远…", "A王A建A国", "L", "言讷行敏", "绅宝谢教练13797013976", "女汉子走天下", "大肥源快乐拥军", "奋斗的青春", "瑛子", "快乐的人", "___", "王芳", "曹祖珍", "程玮舒", "宋宋", "Stacy", "优秀的渣男", "邹锦兰", "王媛", "青青子衿", "郑勇威", "冷辉", "WhoYou", "意想不到", "那年夏天飄零的落葉", "叶子", "肖卓珍", "杜宁", "逗逗", "想想", "杉", "火龙果", "对接团队（谢思彬）", "薛朝方", "ZZZzzzz", "Shirly", "祝同", "Lan", "丸子妈咪", "龙", "Y.u欣", "꧁墨染꧂", "大姚", "小番茄", "活到老，学到老", "刘汉菊", "嘉宇Baby", "停停走走", "真2×痞帅大叔", "黄石港区全安工艺广告部", "艳阳高照(龚爱国)", "菜菜", "Scavengers", "C..c", "蔡乐心妈妈", "宁缺勿滥", "然", "杜杜（家庭教育指导师）1850279579", "刘爱鹅", "桂珍珍", "杨克慧", "平常心", "MR'Lee", "·恃宠而骄", "蔓蔓", "雪酱", "thesunshine(那抹阳光)", "豆果猫猫", "邹剑", "梅", "银泰女吴倩", "李丹", "莉姐", "syd", "千叶陈银", "倪伟", "乾坤", "韩静", "Loser", "昨日的风", "珠珠", "　", "木子易", "安于现状", "周俊佑", "史俊", "coc", "胡汉华", "陈瑾萱妈咪", "A衡阳博远汽配(刘卫)15616698859", "？？", "娟子", "莉", "先琴", "杨芬", "阿港", "淡然", "LIUYAQIN!", "Yao爻爻，", "茉莉花开", "豆豆", "小司", "朱朱", "Rosa", "朱秀萍", "珍珍", "OoLV。", "翰墨春秋", "深海", "像风一样", "任安兰", "简琴兰", "希", "雨晴", "汪旭辉", "请吃蒙牛酸奶冰棍", "程婷", "闵新萍", "楊震-", "", "Untitled", "畅：“”", "青春有妳才精彩", "瑶", "空调班子", "夏夏", "何浩", "丁敏", "~~梦", "杨", "脾气大", "何佑香前海保险18772221890", "不过如此", "风轻云淡", "宝贝_1", "罗晓萍", "空灵", "君临天下", "哎呦卧槽、", "秀", "当当", "椿哥", "须臾", "leo", "丁丁", "Victoria", "ABCD", "一天到晚游泳的鱼", "行人", "玻璃杯", "水墨丹青", "易俊", "比较瘦", "鱼儿", "小丽", "通顺河畔", "wyy－", "heP", "清", "Terri，王丹，13808674949", "兰花", "Grup", "红猪猪", "z", "IchimanuG1n", "尹艳", "Chang_JS", "璎珞MOMO", "向500W招手", "晓意", "IVY", "王先", "A命为志存คิดถึง", "《不忘初心～方得始终》", "花满楼", "毛毛", "顺其自然", "领克郭超", "秋子", "羊羊羊", "小海^_^", "吴芹", "坚持到底", "薇薇安", "春天", "郭燕", "（贾斌妈妈）宁静致远", "郭琮", "可乐记得加冰", "GT", "【邮差外贸】原单", "小小小石头", "老徐麻辣牛肉酱", "戴戴", "燕子", "桂桂", "七彩商贸", "......", "方文秀", "石同玲18872912445", "花开人亦在", "宁伢", "꧁꫞꯭愿爱我的人平安꫞꧂", "浅唱㊣ㄨ寂寞", "徐雪林", "走", "胡郁楠", "子彈TNT", "桃之夭夭、叶蓁蓁", "食客云板扎鸟孔导", "Eileen", "ʚ한나ɞ", "莫失莫忘莫心动", "柏京广告18772907682", "ceci", "BigGod", "沈", "忧伤的雨", "云", "谜一样的白羊男。✨", "海阔天空", "阿涛", "曾", "fan's饭饭", "兰芳", "汽油煎蛋", "张岚", "木易先森", "A明怡美容美发", "", "十里红妆", "独坐对窗棂cium", "阿永18942173520", "+_++_+", "Annie", "A琉璃留離還是流離ツ", "秦巴故里红卫店刘雨", "左耳离心", "尚品", "一路上有你", "AA【晟茂置业】-小张", "设计师하필칭찬받다", "许春林.…", "A~婷", "___梦醒伤人心°", "不忘初心@", "JRW", "刘中文", "老刘", "阳洋阳", "琳", "A雪晴", "欢乐", "程妈", "蒹葭苍苍", "郑跑跑", "正在前行", "WQian", "王成高", "孙玉峰", "莫愁", "萍水相逢18071357711", "猪巧", "信用借款", "明空", "A十堰飞富冠精密机械有限公司", "期待", "LJ（LP）", "寐", "dan", "@初心不变～", "老熊", "r.", "玛丽奥", "淡然", "平凡之路", "吴中军13177477864", "将来", "冯凌", "严敏", "联联", "MFSJ[大兵]鑫联盟随行付POS", "秋水伊人", "杨杨杨", "...❤", "卫青", "陈保朋", "我是向向", "清柠＿初夏", "牡丹花开", "曾晖", "平安果", "青苹果", "中广古色-张丽红", "IEAD~井宿设计（顺）", "傻子", "涂威", "aileen", "蜗牛", "neon", "白猫清洁用品超越清洁see", "丹丹", "fanfan", "韦", "静好", "LQ", "搁浅", "2018发发发", "陈彩荣", "飞儿", "璐璐", "翠翠", "丑丑", "哎哟喂~来日可期", "*~*心愿随缘*~*", "echo", "晴天", "王海18772859996", "郑志康", "George", "郑大钱", "阿涛", "秋天", "姚方舟", "刀子", "wu", "太阳太阳", "尚宏兰15549936618", "王志刚13197275272", "§遗忘过去№missu", "จุ๊บ老幺", "杨杨", "活在当下", "无羡", "Q刚", "憨哥", "王倩", "小程序招商总监-冯振", "见阿", "HH", "Eric", "引领", "只看未来", "葫芦岛小智", "一个人·还", "罗利", "Mr.周", "Angel", "乡土", "陈CC", "一帆风顺", "萬", "李李", "叶源", "朱荣业จุ๊บ", "喜马拉雅", "心想事成", "乔一凡｜路演商道商道系统创始人", "熊伟", "有人", "快服务", "林芳村", "李先", "A~欢乐小哥维修", "夜鹰", "赵云|商有外卖管家", "大家好", "a花辰月夕蛋糕", "老K", "静能生慧", "AAA宜都拼团砍价阿军", "一壶春茶17730006788", "杨", "龙泉周记", "告辞", "风清月扬", "大雨点", "阿弥陀佛", "客服中心", "37度飞凡", "꧁꫞张|斗宏꫞꧂℡18583931070", "honest-小平", "英子", "AiDen", "任之初", "时间的酒", "AJetXu许教", "雨霖", "渐行渐远", "安", "我想我是海", "知足常乐", "刘金龙易商职业培训学校", "A舒浩-宣达实业集团", "龚林", "ghjkl", "眼镜君", "(Tale~)总有刁民想害朕", "侯中洋", "泸州安马@马自达李陈均", "简", "郑秋旋【分享经济】18065563312", "Frank", "winner", "@飞鱼@张丛垒", "华商贸易", "戚华平(大雄)@爱聚", "合一·智圈商业Mr.Z", "粤S", "北京博路盈-王", "王石军", "微领地谭家沛", "风行天下", "陈兰香", "宝妹", "刘兆伟", "小肥", "黄金沙加", "邹", "～心控～", "度遇网络徐闵洋", "v6", "啊哈", "佛陀", "蜂蜜", "jack", "awin", "王岩", "政泽", "LPC", "小芸朵(囿文共享美业)", "哪好网沧州运营中心", "*^_^*", "A888张垒", "荣", "方寸、", "星星，可以睡了", "周", "涅槃", "墨影", "达康书记", "璃殇", "张祖联", "桂仪", "海洋妈妈", "Martin【荷兰-智慧-艺术】", "王利华", "，", "朱益民", "王者归来", "菁菁", "TW.O.WS", "文", "殷鹏涛", "Coco.议文", "深水", "亮点", "Hehuan", "失笑", "黄伟", "秦懿@美嘀嘀共享经济分享模式", "像梦一样自由", "小唐网络", "无崖子", "谁能任性不认命", "AAA一杯清茶", "涛涛", "Ivan", "CHFP理财师-吴新兵", "water", "Cain", "独醉", "王文东Y(^_^)Y", "吴-周平®", "光景", "孤高的浮云", "狼者", "A徐浩", "左旭华", "Dixon", "岚岚", "酱菜", "A东森门业13431801660", "小hi", "立十孑S'agapo", "我", "H.K", "宋先生", "安涛", "千斤顶", "哥*^O^*低调", "a晋泽阀门批发18233178955", "美团饿了么刷销量好评", "哗啦啦的天", "祖传老中医专治吹牛逼", "周义汉13866135540", "刘再江", "快乐皇帝", "白开水", "翱翔天际", "My", "曹波", "hooney", "FanYaling", "onedirection", "Jamie(杰米)", "何处暖阳不倾城", "余鹏", "老董关注眼睛亚健康13595747992", "晴天", "从小沈到老沈", "黑暗中的眼神", "妙妙", "海阔天空", "田辰", "豪门珠宝吕洪波", "展鑫", "刘博通", "幸福来敲门", "静", "说谎的哑巴", "苍狼白鹿", "老张", "金.CG", "Andy", "淡然", "君来商务宾馆", "惠惠", "沃得文化～沙鸿章（网络营销推广）", "晶晶", "陈祥", "简单", "豪腾酒业LXZ18813353833", "A888888中衔-洗车设备", "李慎亭", "alan", "选择大于努力", "王铎", "蒙召", "123", "〇〇〇〇", "从新开始", "坏小子", "XD", "Mr王", "洺铭(明明)", "陶瓷色料（翰林）13535787044", "李方针", "阿LU", "空", "Uncle.席", "vivian", "接受、包容", "好男人", "D.°Q", "Lichinfeng", "财富人生", "瑞瑞", "霆以琛", "小伙子", "一直在路上", "龙飞凤舞", "乔力强", "AA日月空", "峥嵘", "逆行者", "友人常在", "米米", "乘风破浪", "王小天", "&#x1f335;&#x1f335;&#x1f335;", "飞飞鱼", "伙头班，袁小华", "这盛世如你所愿", "雪", "范磊", "互助天天超市（电商）", "天天(徐彬)", "智慧树", "靛蓝", "生活创享家总裁招社区代理-新风口", "猛哥", "一生所爱", "徐国富(富林来凤鱼", "好", "高洋", "Ali", "像我这样的人", "宋涛", "浅笑£安然", "笑红尘", "艾灸养生", "君临城下", "年轻贵在拼搏", "陳玉欣", "Lin*先森", "不屑", "冰糖心", "Chenhaiping", "一路前行", "Abel", "古鲨之贝", "酒嗓", "章程", "银行金融搬运工", "映山红@让鸭脑壳飞13687208423", "周晓文", "希-", "兵哥", "杨晴", "雪豹", "hx", "阿花花", "汽车分期二手车抵押车专员-$伟子$", "Areyousure?", "爱聚马国良Aiju.com", "毛毛", "陈淑芬", "雁南飞", "华", "L.A.S.T", "李刚", "格美", "陈亚慧", "正华医学刘", "周心", "AAAA周琳富", "落花，Chenm", "Riemann-李志奎", "李鹏", "快递服务", "vivo手机顾问：阴亚运", "Lin", "Tokelucify", "喝啤酒吃小龙虾", "张辉", "王昭", "燕燕", "谢海良招商寶貝", "生活不止眼前的苟且", "Gcc", "晦涩15983908200", "路昊", "菜男", "山丘", "Carrie", "保持简单", "唐sir", "玉虚", "pan", "骑士", "如果手机可以扔到水里", "孟", "Allen™", "魏玲", ":-)", "Alice", "马习保", "非凡潮牌男装批发", "罗宽：兰赫酒养颜、祖传酸菜鱼养嘴", "lpw", "笑起来跟猫似的先生。", "洪杰18758568922", "达先森", "茜茜", "70后大叔℡¹³²³⁰⁹⁸¹⁹⁸⁹", "郑铃", "邱玉梅", ".", "宿高", "磊", "勇", "沙漠海", "喜喜", "大兄弟。", "strive", "东霖国际", "俗人。", "徐斌雷", "小小马、", "至尊宝", "陈桢", "γÜωËÎ", "我小叮当还能说点啥", "蒋红", "卢广利", "周浪舟（拒加群）", "曹兴胭（拒广告党）", "Meet", "老蒋", "开水养活鱼", "龙行天下", "格拉GLADBAKERY", "大熊小徐", "铜仁阁尼斯衣柜橱柜（肖律）", "暴走在沙漠里的&#x1f42b;", "小小胖", "自由行天下", "白先生。", "来自一个陌生人", "枫小枫", "sally娜", "A网站制作～小张", "StinkyPig", "zhanghj", "赵松", "", "李", "茜茜公主", "张吉寅新零售服务商", "许多多", "A-郭生「坤兀」", "倪杰文｜朋友圈广告", "_", "梁创泓「佛山坤兀」", "金禧先生Golden（13751522831）", "哎呦喂", "，振强", "李玮@红铅笔（移动营销）", "Ling凌", "阿杰", "凡人", "日月－", "徐来", "Frank", "琴儿", "一个转身俩个世界", "小贝", "做一个对社会有用的人", "丁李terry", "秦涛", "向日葵对着太阳笑", "智凡网络-周丙武", "蔡林甫", "张化永", "段芷琪", "王有华@店立方-新零售", "暂无A人", "快乐作文培训学校", "李小波", "诸葛", "瓜瓜", "胡林_票哆哆", "Andy", "良", "", "Jamin", "陈金明", "hang", "安朋飞", "江中酒仙草运城总代18035981520", "Riche吴泽稳", "我心飞翔", "石头", "朱志强", "Qing", "任少红", "Cairo", "瑞", "灵海顿", "一生所爱", "秋哥（喜厨外卖）", "星辉广告-万象归一", "宏兴饭庄", "慈天硕", "KingHwangfu", "宋朝弟", "空谷幽兰", "悠枫似水", "francis朱宝", "张旭", "吴时翔", "durant35", "辛程", "666", "", "鰂乃铂", "宋阳13197291963", "凡不易", "至知天命", "魏小兰", "哔哔哥", "十八王子℡¹³⁸⁵⁴º⁹⁵⁸⁵³", "小程序", "王峰", "foryou", "谭棋明|微大大|陆地宝|18974866688", "刘星", "享七科技", "A0简非简广告营销策划15829876100", "李先生LIBO18687521518", "有条鱼在水里", "靳夏雨", "电视台马光远", "侯冬生", "", "", "外面的世界", "董小姐私厨（万达店）", "馬駿", "人生沉浮", "二十一画@冬", "师父叫我来巡夜", "柳轻侯(刘勇)", "CKP", "一路向前", "郑Loong", "范志伟", "方圆", "徐大毛。", "句号。", "Zyb", "水。净蓝", "HAOZHILU", "心累", "꧁꫞꯭方꯭方꯭꫞꧂", "Lifewithoutlove", "彭杰", ".", "乐嫁网-曹瑞坤15255256003", "葛哥", "会说话的小木偶", "凹凸凹", "吴先森", "粤膳皇", "笑宸私房18077862626", "一号", "zhongj", "佳闻Kevinจุ๊บ", "陈爱华", "刘波小城特惠", "美鼻大叔老肖", "龙啊子爱雪容妹妹", "薛礼军", "迷失的羊。", "龚小玉", "沁水百合", "孤风傲雨", "Adiós", "吉利", "最美的自己在远方", "美团外卖田雷（18380428359）", "꧁ཉི༺善德之光༻ཉི꧂", "雨中彩虹", "洪杰", "老华", "20171", "木书记", "工行杜", "britney", "despsito", "丶Jokerrr", "爱心爽歪歪", "闪电侠速递(万达专送）", "刘法公18955832643", "道清真和", "技术支持小郭", "QUAN", "田珂", "生", "ldx", "Rolland", "周博弈", "some", "刘金磊", "。。。。。。", "深拥", "LL", "不得你", "공주님", "A十堰大V-1", "东海煎饼欢迎光临", "Miss.L", "亭亭玉立", "刘幽", "And丶小情绪ぅ", "陈岳峰", "Jason", "Frandon", "黄先森", "心平", "无念", "毛丽", "～～", "潘冠存13324858138", "Chris.Ng", "华记味觉饭店", "上上签", "TM", "Yuan", "Tonbo", "v1。", "惠", "我名寻梦鸽子天之痕！！！", "", "Biglion*", "王颖锋（广州天眼互联网科技）", "简强", "༺ཉི九十与他ཉྀ༻", "M李晓", "杜奕萱", "鬼鬼熊么么", "多多田", "乞力马扎罗", "古月", "", "JaneLove", "白开水", "胡晗13135674213", "琴", "张敬东|二师兄|二货优品", "人民不需要张浩", "Bob", "辉", "勾魂", "筱云", "悟.惜", "微笑向阳", "柳絮", "伙伴养车胡锋", "格格她爸", "齐国安13972469635大自然甲鱼馆", "难念的经。", "胖丁家", "AA朱家牛肉汤～蓝色妖姬", "想抱海豚的猫", "我的青春范儿（彭）13687212227", "cap", "凤凰涅槃", "蘑古力", "A-液晶拼接屏--小徐", "翁天平", "爱与被爱，竹纤维防臭袜", "12", "22", "A loved one", "徐俊峰", "太阳红太阳亮", "狐狸糊涂", "相伴一生", "通海俄式烧烤～吉尼斯纪录112.37米", "美丽人生", "Hero", "零零柒", "玉琴。", "葵哥", "随遇而安", "duhong", "舒永梅", "Vvv", "小男孩", "般若.", "朱锦梅", "爱中华", "朱艳萍", "卢文杰", "忆年黄衍博", "Susan惠", "邓赢未欢迎您", "加加不鲁跟", "BetterMan", "老人与海", "水滴", "君漓", "王保同（18910746403）", "餐饮-cium阮树明15280298156", "河北纵横资信网", "专注于3D技术应用", "，，", "倒置太平洋", "汪晓平", "李治成", "黄玉义", "流泉", "友泉", "xiazhengqiu", "张言红", "A-张廷冠", "马双来", "林廷旭", "", "yinqing", "qpqp", "消失", "一个人的旅行", "Z-", "小明他姐", "Ryan杨杰", "M.", "彭小燕", "wq", "浮踪浪迹", "中国平安蒋艳13297149930", "苗苗", "Sept.", "东：经常不在线，有事电话联系。", "刘洋|腾辉控股|心力行", "小鑫", "饶德孟", "吴昊", "大树小良", "武星", "w", "老甘特色菜馆", "", "习惯了所有", "老街印象徐波13597903440", "陈雷@loosee乐熙", "", "Sam", "Libra", "stenven", "万韬", "邓明华（好兄弟）", "阿拉丁", "宜凡", "康桥离人", "上善若水", "徐策", "俆冼泩", "小霞", "上善若水", "Vici！", "命甴己造", "王羽豪", "阿晕", "Burgess.Yu", "麦穗", "大娱乐家", "。", "木小可", "合众时代", "假装不在", "邓洋洋", "如是我闻", "峰", "玉树", "邓皆斌", "秦巴果园刘馨卉", "一人一座城", "时光℉", "Bigger", "梁胤威", "欢", "周星星", "帅斌", "", "金小龙", "AA弈刀", "Adolph", "风中叶子", "王刚ChristopherKMY", "M～I_pipi", "Lu琴", "小永远", "陳巧辣", "uiui", "王超", "陈庆民18063529192", "三堰万秀场苏宁家电顾问齐彬", "无言", "ཎཽ沙漠飞鹰ནཽ", "王佳", "艳霞", "政言", "终极", "", "ayu颖啊", "小强", "玄羽子", "玄羽子", "nayan", "合众时代-郭建明", "Joe", "莉莉周", "雪丽糍", ".·久伴", "章涛-Dogdog", "刘振国18735429450", "四川朗清环境（专业环保治理）", "a", "快乐大猫", "御品轩喷泉", "Z", "享七客服001", "享七科技", "缘", "吴鹏", "趙國慶", "禾了一", "朱健", "king", "添.TT", "李斌", "樱花树下、那纯美一笑", "橘子", "港湾", "茯苏", "遗忘之地", "芝麻开门智能科技", "挑战不可能", "波小波", "简捷『营销", "睦瑟", "深创投互联网基金～刘敏", "刘辉", "SibylYang", "为你心跳", "戴振义", "阿炎Alex", "我二叔张嘉译", "摇了摇头", "Hy呀", "津甸园ZINDEN", "楠羽日本跨境贸易0风险兼職创业", "十大杰出青年生活创享家总裁", "木子", "感谢有你", "徐记麻辣烫砂锅米线13465395507", "Little_", "2012"
            };
            String unionCode = RandomStringUtil.getRandomCode(22, 6);
            userNew.setOpenId("ogDNV4" + openCode);
            userNew.setUnionId("okoAq1" + unionCode);
            userNew.setUserIp(GetUserInfoUtil.getRandomIp());
            userNew.setNickName(nickNames[r.nextInt(nickNames.length)]);
            userNew.setUserName(GetUserInfoUtil.getTelPhone());
            userNew.setMobile(userNew.getUserName());
            userNew.setCreateTime(GetUserInfoUtil.randomDate(beginTime, endTime));
            userNew.setLoginTimes(r.nextInt(10));
            userNew.setSourceType(1);  //来源小程序
            Long id = userService.batchAdd(userNew);
        }

        return new BaseResp<Integer>(ResultStatus.SUCCESS, 1);
    }

    /**
     * 注意:批量执行的时候,循环条件一定要在controller里面,因为如果放到service里面,使用的是同一个dao,则会一直用一个事物提交,
     * 哪怕你没有写事物注解,但是dao层会把所有批量数据当做一个事物,放到controller之后,@Autowird注解是单例的,每次创建都会new一个新的出来,
     * 这个地方一定要注意,否则在并发量高的时候会引起表锁
     * @param inVo
     * @return
     */
    @RequestMapping(value = "/batchUpdate",method = RequestMethod.POST)
    public BaseResp<Integer> batchUpdate(UserInVo inVo,Date beginTime,Date endTime){
        List<User> list = userService.batchList(inVo);
        for (User user : list) {
            if(beginTime!=null&&endTime!=null) {
                user.setCreateTime(GetUserInfoUtil.randomDate(beginTime, endTime));
            }
            Integer re = userService.batchUpdate(user);
        }
        return new BaseResp<Integer>(ResultStatus.SUCCESS,null);
    }



    /**
     * 通过encrypData和ivData和sessionKey新增用户
     * @return
     */
    @ResponseBody
    @RequestMapping(value = "/addUserUnionIdAndPhoneAES", method = RequestMethod.POST)
    public BaseResp<User> addUserUnionIdAndPhoneAES(@Valid WeixinPhoneInvo inVo,BindingResult result,HttpServletRequest request){
        if(result.hasErrors()) {
            List<ObjectError> list = result.getAllErrors();
            return new BaseResp<User>(ResultStatus.FAIL.getErrorCode(), list.get(0).getDefaultMessage(), null);
        }

        byte[] encrypData = Base64.decodeBase64(inVo.getEncrypData());
        byte[] ivData = Base64.decodeBase64(inVo.getIvData());
        byte[] sessionKey = Base64.decodeBase64(inVo.getSessionKey());

        String decrypt = null;
        try {
            decrypt = AESDecodeUtils.decrypt(sessionKey, ivData, encrypData);
        } catch (Exception e) {
            e.printStackTrace();
            return new BaseResp<User>(ResultStatus.FAIL);
        }
        JSONObject jsonObject = JSONObject.parseObject(decrypt);
        String openId = null;
        String unionId = null;
        if (jsonObject != null) {
            openId = jsonObject.getString("openId");
            unionId = jsonObject.getString("unionId");
        }
        //获取openId
        if (StringUtils.isEmpty(openId)||StringUtils.isEmpty(unionId)) {
            return new BaseResp<User>(ResultStatus.error_param_empty);
        }
            /*
            通过unionid查询唯一用户，如果没有查到再查询openId，如果也没有查到证明是新用户或者是仅仅通过手机号在商家端里面注册的用户，直接插入数据即可,
            如果通过unionid没查到，通过openId查到了，则证明是之前的老用户，没有unionId，则更新用户，返回userId给前端,
            如果通过unionid查到了用户，则里面必有openId,再比较其中的openId，如果openId相等的话，则不用更新用户，不相等的话更新用户(更新openId)
            */
        User byUnionId = userService.findByUnionId(unionId);
        User user = userService.findByOpenId(openId);
        if(byUnionId==null){
            if(user!=null){
                user.setUnionId(unionId);
                Integer update = userService.update(user);
                User userById = userService.getUserById(user.getId());
                return new BaseResp<User>(ResultStatus.error_user_exist,userById);
            }
        }else if(byUnionId!=null){
            if(!StringUtils.equals(byUnionId.getOpenId(),openId)){
                byUnionId.setOpenId(openId);
                Integer update = userService.update(byUnionId);
                User userById = userService.getUserById(byUnionId.getId());
                return new BaseResp<User>(ResultStatus.error_user_exist,userById);
            }
            return new BaseResp<User>(ResultStatus.error_user_exist,byUnionId);
        }

            /*User user = userService.findByOpenId(openId);
            if(user != null){
                return new BaseResp<Long>(ResultStatus.error_user_exist,user.getId());
            }*/
        User userNew = new User();
        userNew.setOpenId(openId);
        userNew.setUnionId(unionId);
        userNew.setUserIp(IpUtils.getIpAddr(request));
        Date date = new Date();
        SimpleDateFormat sdf = new SimpleDateFormat("yyyyMMddHHssmm");
        userNew.setUserName("xq_" + sdf.format(date));
            /*userNew.setPassword(RandomStringUtil.getRandomCode(6,3));
            userNew.setPassword(DigestUtils.md5DigestAsHex(userNew.getPassword().getBytes()));*/
        userNew.setSourceType(1);  //来源小程序
        Long id  = userService.add(userNew);
        User userById = null;
        if(id!=null) {
            userById = userService.getUserById(id);
        }
        return new BaseResp<User>(ResultStatus.SUCCESS, userById);
    }

    /**
     * 通过code获取用户信息
     * @param code
     * @return
     */
    @RequestMapping(value = "/findByCode",method = RequestMethod.GET)
    @ResponseBody
    public BaseResp<User> findByCode(String code){
        //获取openId
        if (StringUtils.isEmpty(code)) {
            return new BaseResp<User>(ResultStatus.error_weixin_user_code_empty);
        }
        //获取openId
        String param = "?grant_type=" + PaymentConfig.GRANT_TYPE + "&appid=" + PaymentConfig.APPID + "&secret=" + PaymentConfig.API_KEY + "&js_code=" + code;
        //创建请求对象
        String httpRet = PayUtils.httpRequest(PaymentConfig.GET_OPEN_ID_URL, "GET", param);
        Map<String, String> result = new HashMap<String, String>();
        JSONObject jsonObject = JSONObject.parseObject(httpRet);
        if (jsonObject != null) {
            Integer errcode = jsonObject.getInteger("errcode");
            if (errcode != null) {
                //返回异常信息
                return new BaseResp<User>(errcode, jsonObject.getString("errmsg"), null);
            }
            String openId = jsonObject.getString("openid");
            User user = userService.findByOpenId(openId);
            if(user != null){
                return new BaseResp<User>(ResultStatus.SUCCESS,user);
            }
            user = new User();
            user.setOpenId(openId);
            return new BaseResp<User>(ResultStatus.SUCCESS,user);

        }
        return new BaseResp<User>(ResultStatus.FAIL);
    }

    /**
     * @Description: 获取openId
     * @param: code
     * @Author: zhangpeng32
     * @Date: 2018/3/11 17:39
     * @Version: 1.0.0
     */
    @ResponseBody
    @RequestMapping(value = "/getOpenId", method = RequestMethod.POST)
    public BaseResp<Map<String, String>> getOpenId(String code, HttpServletRequest request) throws Exception{
        if (StringUtils.isEmpty(code)) {
            return new BaseResp<Map<String, String>>(ResultStatus.error_weixin_user_code_empty);
        }
        //获取openId
        String param = "?grant_type=" + PaymentConfig.GRANT_TYPE + "&appid=" + PaymentConfig.APPID + "&secret=" + PaymentConfig.APP_SECRET + "&js_code=" + code;
        System.out.println(PaymentConfig.GET_OPEN_ID_URL + param);
        //创建请求对象
        String httpRet = PayUtils.httpRequest(PaymentConfig.GET_OPEN_ID_URL, "GET", param);
        Map<String, String> result = new HashMap<String, String>();
        JSONObject jsonObject = JSONObject.parseObject(httpRet);
        if (jsonObject != null) {
            Integer errcode = jsonObject.getInteger("errcode");
            if (errcode != null) {
                //返回异常信息
                return new BaseResp<Map<String, String>>(errcode, jsonObject.getString("errmsg"), null);
            }
            result.put("openId", jsonObject.getString("openid"));
            result.put("sessionKey", jsonObject.getString("session_key"));
            User user = userService.findByOpenId(jsonObject.getString("openid"));
            String unionid = jsonObject.getString("unionid");
            if(StringUtils.isNotBlank(unionid)) {
                result.put("unionId", unionid);
            }else{
                if(user!=null){
                    result.put("unionId", user.getUnionId());
                }
            }
        }
        return new BaseResp<Map<String, String>>(ResultStatus.SUCCESS, result);
    }

    /**
     *获取微信用户的手机号
     * @param inVo
     * @param result
     * @return
     */
    @RequestMapping(value = "/phoneAES",method = RequestMethod.POST)
    @ResponseBody
    public BaseResp<String> phoneAES(@Valid WeixinPhoneInvo inVo,BindingResult result){
        if(result.hasErrors()) {
            List<ObjectError> list = result.getAllErrors();
            return new BaseResp<String>(ResultStatus.FAIL.getErrorCode(), list.get(0).getDefaultMessage(), null);
        }

        byte[] encrypData = Base64.decodeBase64(inVo.getEncrypData());
        byte[] ivData = Base64.decodeBase64(inVo.getIvData());
        byte[] sessionKey = Base64.decodeBase64(inVo.getSessionKey());

        String decrypt = null;
        try {
            decrypt = AESDecodeUtils.decrypt(sessionKey, ivData, encrypData);
        } catch (Exception e) {
            e.printStackTrace();
            return new BaseResp<String>(ResultStatus.FAIL,e.getMessage());
        }

        return new BaseResp<String>(ResultStatus.SUCCESS,decrypt);
    }

    @RequestMapping(value = "/selectNewShop",method = RequestMethod.GET)
    @ResponseBody
    public BaseResp<String>  selectNewShop(){
       String re =  shopService.selectNewShop();
        return new BaseResp<String>(ResultStatus.SUCCESS,re);
    }
}
